#include <iostream>
using namespace std;
int main() {
	system("chcp 1251");
	int const max_day_28 = 28;
	int const max_day_29 = 29;
	int const max_day_30 = 30;
	int const max_day_31 = 31;
	int d, m, y;
	cout << "Введите цифрами сегодняшнюю дату (число, месяц, год) -> "; cin >> d >> m >> y;
	if ((m == 1 || m == 3 || m == 5 || m == 7 || m == 8 || m == 10) && (d == max_day_31))
	{
		d = 1;
		m += 1;
		cout << "Последний день месяца! Завтра: " << d << "." << m << "." << y;
	}
	else if ((m == 12) && (d == max_day_31))
	{
		d = 1;
		m = 1;
		y += 1;
		cout << "Последний день месяца! С наступающим новым годом! Завтра: " << d << "." << m << "." << y;
	}
	else if ((m == 4 || m == 6 || m == 9 || m == 11) && (d == max_day_30))
	{
		d = 1;
		m += 1;
		cout << "Последний день месяца! Завтра: " << d << "." << m << "." << y;
	}
	else if (((y % 4 == 0) && (y % 100 != 0)) && (m == 2) && (d == max_day_28) || (y % 400 == 0) && (m == 2) && (d == max_day_28)) // Проверка на високосный год
	{
		d += 1;
		cout << "Завтра: " << d << "." << m << "." << y;
	}
	else if (((y % 4 == 0) && (y % 100 != 0)) && (m == 2) && (d == max_day_29) || (y % 400 == 0) && (m == 2) && (d == max_day_29)) // Проверка на високосный год
	{
		d = 1;
		m += 1;
		cout << "Завтра: " << d << "." << m << "." << y;
	}
	else if ((m == 2) && (d == max_day_28))
	{
		d = 1;
		m += 1;
		cout << "Последний день месяца! Завтра: " << d << "." << m << "." << y;
	}
	else 
	{
		d += 1;
		cout << "Завтра: " << d << "." << m << "." << y;
	}
	return 0;
}
